# RbsDuctSystemCalculationParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsDuctSystemCalculationParam Property
ParameterTypeId Class See Also
---
"Calculations"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsDuctSystemCalculationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsDuctSystemCalculationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsDuctSystemCalculationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace